# GetElementFilter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPerformanceAdviserRule..::..GetElementFilter Method
IPerformanceAdviserRule Interface See Also
---
Retrieves a filter to restrict elements to be checked.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
ElementFilter GetElementFilter(
	Document document
)
```

Visual Basic
---
```text
Function GetElementFilter ( _
	document As Document _
) As ElementFilter
```

Visual C++
---
```text
ElementFilter^ GetElementFilter(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document for which performance problems are being checked.
# ### Return Value
The filter to restrict elements to be checked.
# Remarks
If the rule needs to be executed on individual elements, it should return a filter that defines what elements the rule should apply to. Otherwise, nothing (i.e. null) should be returned. If filter is returned, it should stay valid till the end of the check.
# See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace